Wiznet/esp_wiz_toe/examples/dhcp_dns/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# CONFIG_COMPILER_OPTIMIZATION_DEBUG is not set
# --- wsm_driver shared settings (copied from loopback) ---
CONFIG_WSM_DRIVER_ENABLED=y
# Board = ESP32-W5500-Dev-kit, the component Kconfig default. The board fixes
# both the chip and the SPI pins; pick another one in menuconfig:
#   Component config -> WIZnet WSM Driver -> Board
CONFIG_WSM_DRIVER_BACKEND_TOE=y
# pins/clock come from the board selected above
# Switch to CONFIG_WSM_DRIVER_BACKEND_ETH=y to run the chip as an esp_eth
# MACRAW MAC; the Ethernet vtable then uses esp_netif DHCP + the LwIP resolver
# instead of the ioLibrary clients (see src/eth_dhcp_dns.c).
